ConvertFrom-StringData -StringData @'
	# ar-sa
	# Arabic (Saudi Arabia)

	API                             = واجهة برمجة التطبيقات
	RuleNameNotInput                = يرجى ملء اسم القاعدة
	RuleNewNameTips                 = لا يمكن أن يتجاوز اسم الاختصار {0} من الأحرف ولا يمكن أن يحتوي على: مسافات بادئة وزائدة، \\ / : * ? & @ ! "" < > |
	RuleNewPathISCheck              = التحقق من توفر مسار الملف
	RuleNameFormat                  = تنسيقات الملفات المدعومة
	RuleNoImport                    = لم يعد يتم استخدام الاستيراد ( الوراثة ) للتشغيل
	Extract_Tips                    = تَلمِيح\n\n   1. لا يمكن استخدام النتيجة بعد استخراج حزمة اللغة ككائن مرجعي رئيسي؛\n\n   2. يرجى استخدام قائمة المكونات ككائن مرجعي رئيسي. كيفية الإنشاء:\n\n       حدد المكون الذي تم إنشاؤه (احصل على الحزمة في الصورة المثبتة) في Functions، وحدد طباعة أو عرض على الفور؛\n\n   3. بعد تثبيت حزمة اللغة، يرجى إعادة إنشاء تقرير المكون للتحقق مما إذا كان مطابقًا أم لا؛
'@